/**
 * Image Server.
 * 
 * 1. INTRODUCTION
 * 
 * Runs a server on TCP port 5555, accepting connections and serving over
 * shared memory images warped by the Intel GPU.
 * 
 * 2. STARTUP
 * 
 * At startup, the program takes two arguments:
 * 
 *     ./imgserver PathToHDF5File LocalTCPPort#
 * 
 * The first is the path to the catsanddogs.hdf5 file whose contents are to be
 * served. The second is the local port to bind to.
 * 
 * The program finds an Intel OpenCL implementation with an Intel iGPU, and
 * builds an OpenCL kernel.
 * 
 * The program sets up a TCP server socket on the LocalTCPPort#.
 * 
 * The program loads, then memory-maps the entire dataset using the HDF5 API.
 * 
 * 3. RUNTIME
 * 
 * The program waits on the server socket for connection attempts. When a
 * connection is made, it services the requests coming from the remote end and
 * acknowledges them.
 * 
 * 4. PROTOCOL
 * 4.1. START PACKET
 * 
 * Form: 0x00
 * Ack:  0x80
 * 
 * 4.2. CONFIG PACKET
 * 
 * Form: 0x01 [uint32_t cfgRqNum] {data...}
 * Ack:  0x81
 * 
 * 4.3. DATA REQUEST PACKET
 * 
 * Form: 0x10          (Training,   Random,     Warped,   Buffer 0)
 * Form: 0x11          (Training,   Random,     Warped,   Buffer 1)
 * Form: 0x12          (Training,   Random,     Unwarped, Buffer 0)
 * Form: 0x13          (Training,   Random,     Unwarped, Buffer 1)
 * Form: 0x14          (Training,   Non-Random, Warped,   Buffer 0)
 * Form: 0x15          (Training,   Non-Random, Warped,   Buffer 1)
 * Form: 0x16          (Training,   Non-Random, Unwarped, Buffer 0)
 * Form: 0x17          (Training,   Non-Random, Unwarped, Buffer 1)
 * Form: 0x18          (Validation, Random,     Warped,   Buffer 0)
 * Form: 0x19          (Validation, Random,     Warped,   Buffer 1)
 * Form: 0x1A          (Validation, Random,     Unwarped, Buffer 0)
 * Form: 0x1B          (Validation, Random,     Unwarped, Buffer 1)
 * Form: 0x1C          (Validation, Non-Random, Warped,   Buffer 0)
 * Form: 0x1D          (Validation, Non-Random, Warped,   Buffer 1)
 * Form: 0x1E          (Validation, Non-Random, Unwarped, Buffer 0)
 * Form: 0x1F          (Validation, Non-Random, Unwarped, Buffer 1)
 * Ack:  Above | 0x80
 * 
 * The buffer# indicates which buffer, out of two, to write fresh data in. For
 * instance, if the remote process is running a double buffer during training,
 * then before it processes buffer 0 it should make the request 0x11 for
 * training data to be written to buffer 1. When the remote process finishes
 * with buffer 0, it should wait for the Ack 0x91, make the request 0x10 for
 * new training data in buffer 0, then start processing buffer 1.
 * 
 * 4.4. EXIT PACKET
 * 
 * Form: 0x7F
 * Ack:  0xFF
 */

/* Do we want display? */
#define OCVDISP               1

/* Includes */
#include <hdf5.h>
#include <signal.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include <errno.h>
#include <unistd.h>
#include <fcntl.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/mman.h>
#include <sys/socket.h>
#include <arpa/inet.h>
#if OCVDISP
#include <opencv2/core/core.hpp>
#include <opencv2/highgui/highgui.hpp>
#endif
#include <cuda.h>
#include <cuda_runtime_api.h>
#include <npp.h>



/* Defines */
#define OCL_INTEL_PLATFORM    "Intel"
#define OCL_INTEL_DEVICE      "Intel(R) HD Graphics Haswell GT2 Mobile"
#define DEFAULT_PORT          (5555)


/* Data structures */

/**
 * Global data.
 */

typedef struct{
	/* Program arguments */
	int                argc;
	const char**       argv;
	const char*        dataPath;
	
	/* Status */
	int                exiting;
	
	/* Networking globals */
	uint16_t           localPort;
	sockaddr_in        localAddr;
	size_t             localAddrLen;
	int                ssockFd;
	
	/* Data globals */
	unsigned long long dataFileLen;
	int                dataFd;
	void*              dataPtr;
	float            (*dataY)[2];
	uint8_t          (*dataX_64x64)  [3][ 64][ 64];
	uint8_t          (*dataX_128x128)[3][128][128];
	uint8_t          (*dataX_256x256)[3][256][256];
	
	/* CUDA */
	float            (*devDataY)[2];
	Npp8u            (*devDataX_64x64)  [3][ 64][ 64];
	Npp8u            (*devDataX_128x128)[3][128][128];
	Npp8u            (*devDataX_256x256)[3][256][256];
} GLOBAL_DATA;

/**
 * Per-connection context.
 */

typedef struct{
	/* Status locals */
	int              exit;
	
	/* Config */
	uint64_t         xorshift128p[2];
	
	/* CUDA */
	void*            devBounceBuf;
	
	/* Network locals */
	int              sockFd;
	sockaddr_in      remoteAddr;
	socklen_t        remoteAddrLen;
} CONN_CTX;

/**
 * Data Request Packet.
 */

typedef struct{
	uint64_t           req;          /* 0x00 */
	uint64_t           batchSize;    /* 0x08 */
	uint64_t           first;        /* 0x10 */
	uint64_t           last;         /* 0x18 */
	cudaIpcMemHandle_t Y;            /* 0x20 */
	cudaIpcMemHandle_t X;            /* 0x60 */
	uint64_t           sizeIn;       /* 0xA0 */
	uint64_t           sizeOut;      /* 0xA8 */
	uint64_t           x128ps0;      /* 0xB0 */
	uint64_t           x128ps1;      /* 0xB8 */
	double             maxT;         /* 0xC0 */
	double             maxR;         /* 0xC8 */
	double             minS;         /* 0xD0 */
	double             maxS;         /* 0xD8 */
} CONN_PKT;



/* Global Variables */
GLOBAL_DATA gData;



/* Forward Declarations */
int       imgsNetworkSetup(GLOBAL_DATA* gData);
void      imgsNetworkTeardown(GLOBAL_DATA* gData);
int       imgsDataSetup(GLOBAL_DATA* gData);
void      imgsDataTeardown(GLOBAL_DATA* gData);
int       imgsCUDASetup(GLOBAL_DATA* gData);
void      imgsCUDATeardown(GLOBAL_DATA* gData);
CONN_CTX* imgsConnAlloc(GLOBAL_DATA* gData);
CONN_CTX* imgsConnAccept(GLOBAL_DATA* gData);
int       imgsConnSetup(GLOBAL_DATA* gData, CONN_CTX* connCtx);
void      imgsConnHandlePacket(GLOBAL_DATA* gData, CONN_CTX* connCtx);
int       imgsConnReadPacket(GLOBAL_DATA* gData, CONN_CTX* connCtx, CONN_PKT* pkt);
uint64_t  imgsConnSelectImage(GLOBAL_DATA* gData,
                              CONN_CTX*    connCtx,
                              CONN_PKT*    pkt,
                              int          i);
void      imgsConnWantExit(CONN_CTX* connCtx);
